#+TITLE: __VA_ARGS__ counting and iteration macros

** Building unit tests
#+begin_src sh :results verbatim
  mkdir -p build
  pushd build
  cmake ..
  cmake --build .
  popd
#+end_src

#+RESULTS:
#+begin_example
~/dev/c/va_args_iterators/build ~/dev/c/va_args_iterators
Re-run cmake no build system arguments
-- The C compiler identification is GNU 12.1.0
-- The CXX compiler identification is GNU 12.1.0
-- Detecting C compiler ABI info
-- Detecting C compiler ABI info - done
-- Check for working C compiler: /usr/bin/cc - skipped
-- Detecting C compile features
-- Detecting C compile features - done
-- Detecting CXX compiler ABI info
-- Detecting CXX compiler ABI info - done
-- Check for working CXX compiler: /usr/bin/c++ - skipped
-- Detecting CXX compile features
-- Detecting CXX compile features - done
-- Configuring done
-- Generating done
-- Build files have been written to: /home/cormacc/dev/c/va_args_iterators/build
/usr/bin/cmake -S/home/cormacc/dev/c/va_args_iterators -B/home/cormacc/dev/c/va_args_iterators/build --check-build-system CMakeFiles/Makefile.cmake 0
/usr/bin/cmake -E cmake_progress_start /home/cormacc/dev/c/va_args_iterators/build/CMakeFiles /home/cormacc/dev/c/va_args_iterators/build//CMakeFiles/progress.marks
/usr/bin/make  -f CMakeFiles/Makefile2 all
make[1]: Entering directory '/home/cormacc/dev/c/va_args_iterators/build'
/usr/bin/make  -f CMakeFiles/tests.dir/build.make CMakeFiles/tests.dir/depend
make[2]: Entering directory '/home/cormacc/dev/c/va_args_iterators/build'
cd /home/cormacc/dev/c/va_args_iterators/build && /usr/bin/cmake -E cmake_depends "Unix Makefiles" /home/cormacc/dev/c/va_args_iterators /home/cormacc/dev/c/va_args_iterators /home/cormacc/dev/c/va_args_iterators/build /home/cormacc/dev/c/va_args_iterators/build /home/cormacc/dev/c/va_args_iterators/build/CMakeFiles/tests.dir/DependInfo.cmake --color=
make[2]: Leaving directory '/home/cormacc/dev/c/va_args_iterators/build'
/usr/bin/make  -f CMakeFiles/tests.dir/build.make CMakeFiles/tests.dir/build
make[2]: Entering directory '/home/cormacc/dev/c/va_args_iterators/build'
[ 50%] Building CXX object CMakeFiles/tests.dir/test/pp_iter_test.cpp.o
/usr/bin/c++  -I/home/cormacc/dev/c/va_args_iterators -I/home/cormacc/dev/c/va_args_iterators/vendor/catch -std=gnu++20 -MD -MT CMakeFiles/tests.dir/test/pp_iter_test.cpp.o -MF CMakeFiles/tests.dir/test/pp_iter_test.cpp.o.d -o CMakeFiles/tests.dir/test/pp_iter_test.cpp.o -c /home/cormacc/dev/c/va_args_iterators/test/pp_iter_test.cpp
[100%] Linking CXX executable tests
/usr/bin/cmake -E cmake_link_script CMakeFiles/tests.dir/link.txt --verbose=1
/usr/bin/c++ -rdynamic CMakeFiles/tests.dir/test/pp_iter_test.cpp.o -o tests
make[2]: Leaving directory '/home/cormacc/dev/c/va_args_iterators/build'
[100%] Built target tests
make[1]: Leaving directory '/home/cormacc/dev/c/va_args_iterators/build'
/usr/bin/cmake -E cmake_progress_start /home/cormacc/dev/c/va_args_iterators/build/CMakeFiles 0
~/dev/c/va_args_iterators
#+end_example

** Running unit tests
#+begin_src sh :results verbatim
./build/tests
#+end_src

#+RESULTS:
: ===============================================================================
: All tests passed (20 assertions in 4 test cases)
:

